#====================================================================================================
# 작성일자 : 2021.03.29
# 작성목적 : Advaned R 1장 관련 소스 
#====================================================================================================

library(lobstr)
install.packages("lobstr")

# Quiz 1
# df 데이터프레임의 컮럼3을 생성하여라. 
df <- data.frame(runif(3), runif(3))
df
names(df) <- c(1, 2)
df

# 답 
df$'3' <- NA  #에러발생 


# Quiz 2
# y는 얼마나 많은 메모리를 할당 받나?
x <- runif(1e6)
y <- list(x, x, x)
object.size(y)

# Quiz 3
a <- c(1, 5, 3, 2)
b <- a
b[[1]] <- 10
b


#======================================================================================

x <- c(1, 2, 3)
y <- x

obj_addr(x)  #{lobstr}
obj_addr(y)  #{lobstr}



